Revit 2024 API
SolidGlass.SolidglassGlossiness Property
 The property labeled "Roughness" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string SolidglassGlossiness { get; }
Visual Basic
Public Shared ReadOnly Property SolidglassGlossiness As String
	Get
Visual C++
public:
static property String^ SolidglassGlossiness {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace